{
  "backend/main.mo": "Actor providing contact form submission, admin-only retrieval of contact requests, and user profile CRUD with AccessControl-based authorization.",
  "feature_evidence.json": "Feature evidence report linking a landing page hero image update to specific frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files covering styles, components, configuration, and assets.",
  "frontend/.ic-assets.json": "Asset configuration enabling inclusion of the .well-known directory.",
  "frontend/index.css": "Tailwind base layer defining color tokens, dark mode variables, and global background/foreground styling.",
  "frontend/index.html": "Main HTML entry point with SEO meta tags, fonts, and root div for the React app.",
  "frontend/public/.well-known/ic-domains": "Domain configuration file listing approved domains for the app.",
  "frontend/public/robots.txt": "Robots.txt allowing major crawlers full access to all paths.",
  "frontend/src/App.tsx": "Root React component composing the full landing page sections in order.",
  "frontend/src/components/AboutSection.tsx": "About section presenting business description, trust indicators, and a featured image.",
  "frontend/src/components/ContactForm.tsx": "Form component posting directly to Formspree with required name, email, phone, and message fields.",
  "frontend/src/components/ContactSection.tsx": "Contact section combining the contact form with business details and social links.",
  "frontend/src/components/FeaturesSection.tsx": "Features section listing four service highlights with icons and a CTA linking to YouTube.",
  "frontend/src/components/Footer.tsx": "Footer component with brand info, navigation links, legal links, and a dynamic year plus attribution.",
  "frontend/src/components/HeroSection.tsx": "Hero section with background image, headline, CTA buttons, and a scroll indicator.",
  "frontend/src/components/LandingHeader.tsx": "Responsive header with logo, navigation, scroll-based styling, and mobile menu toggle.",
  "frontend/src/components/ScheduleConsultationSection.tsx": "Section that loads and displays a Calendly widget after clicking a booking button.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication, login state, and stored identities.",
  "frontend/src/hooks/useSubmitContactRequest.ts": "Empty placeholder file for a contact request submission hook.",
  "frontend/src/index.css": "Tailwind setup with custom color variables and global styles for light and dark themes.",
  "frontend/src/lib/scrollToSection.ts": "Utility to smooth-scroll to a section by ID with header offset adjustment.",
  "frontend/src/main.tsx": "App entry point that initializes React, React Query, Internet Identity provider, and global styles.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL and hash parameters, persist them in sessionStorage, and clear them from the hash without reloading.",
  "frontend/tailwind.config.js": "TailwindCSS configuration defining theme colors, fonts, breakpoints, animations, and plugin usage.",
  "project_state.json": "Holds project metadata, feature lists, and state tracking for the Real Estate Landing project."
}