{
  "backend/main.mo": "Implements contact request storage and user profile management with access-control checks for viewing and saving data.",
  "feature_evidence.json": "Feature evidence report describing a footer color update and listing related files, components, tests, and metadata.",
  "frontend-file-summaries.txt": "Pre-generated summaries of key frontend files, including styling, components, and configuration details.",
  "frontend/.ic-assets.json": "Configures asset inclusion rules, ensuring the .well-known directory is not ignored during deployment.",
  "frontend/index.css": "Defines global Tailwind base layers and OKLCH design tokens for light and dark themes, covering backgrounds, text, and UI colors.",
  "frontend/index.html": "HTML entry point loading fonts, metadata, and the root script for the React application.",
  "frontend/public/.well-known/ic-domains": "Lists the verified domains for Internet Computer custom domain configuration.",
  "frontend/public/robots.txt": "SEO-friendly robots.txt allowing all major crawlers full access.",
  "frontend/src/App.tsx": "Main React app composing all landing page sections including header, content, and footer.",
  "frontend/src/components/AboutSection.tsx": "About section component with business description, trust indicators, and an image layout.",
  "frontend/src/components/ContactForm.tsx": "Simple Formspree-backed contact form with required fields and styled inputs.",
  "frontend/src/components/ContactSection.tsx": "Contact page section combining the contact form, business details, and social links.",
  "frontend/src/components/FeaturesSection.tsx": "No summary available.",
  "frontend/src/components/Footer.tsx": "No summary available.",
  "frontend/src/components/HeroSection.tsx": "No summary available.",
  "frontend/src/components/LandingHeader.tsx": "No summary available.",
  "frontend/src/components/ScheduleConsultationSection.tsx": "No summary available.",
  "frontend/src/hooks/useActor.ts": "No summary available.",
  "frontend/src/hooks/useInternetIdentity.ts": "No summary available.",
  "frontend/src/hooks/useSubmitContactRequest.ts": "No summary available.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for theming in light and dark modes, including custom colors and layout settings.",
  "frontend/src/lib/scrollToSection.ts": "Provides a smooth-scroll helper that scrolls to an element by ID with header offset handling.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and sessionStorage parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, shadows, animations, and containers using CSS variable–driven design tokens.",
  "project_state.json": "Metadata describing project state, features, and requests for managing the footer background color update."
}