{
  "backend/main.mo": "Implements contact request storage and user profile management with access control checks for viewing and editing data.",
  "feature_evidence.json": "Defines feature evidence entries linking features to files, components, and test IDs for build tracking.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of frontend files and their purposes for reference.",
  "frontend/.ic-assets.json": "Configures asset publishing to include the .well-known directory for domain verification.",
  "frontend/index.css": "Defines global Tailwind-based styling and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point setting metadata, fonts, and mounting the React app root.",
  "frontend/public/.well-known/ic-domains": "Lists domain names used for Internet Computer custom domain verification.",
  "frontend/public/robots.txt": "Allows Googlebot, Bingbot, PerplexityBot, and all other crawlers full access to all site paths.",
  "frontend/src/App.tsx": "Main app component that assembles all landing page sections into a single layout.",
  "frontend/src/components/AboutSection.tsx": "Renders an about section with descriptive text, trust indicators, and an accompanying image.",
  "frontend/src/components/ContactForm.tsx": "Provides a Formspree-backed contact form with required fields and styled inputs.",
  "frontend/src/components/ContactSection.tsx": "Displays the contact form alongside contact details and social media links.",
  "frontend/src/components/FeaturesSection.tsx": "Renders a features grid with icons, titles, and descriptions plus a header and CTA linking to YouTube.",
  "frontend/src/components/Footer.tsx": "Displays the site footer with brand info, navigation links, legal links, and a credit bar.",
  "frontend/src/components/HeroSection.tsx": "Shows a hero banner with background image, headline, description, and buttons that scroll to sections.",
  "frontend/src/components/LandingHeader.tsx": "Implements a responsive header with logo, scroll-aware styling, desktop and mobile navigation, and a booking button.",
  "frontend/src/components/ScheduleConsultationSection.tsx": "Provides a booking section that loads and displays a Calendly embed when the user clicks the booking button.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, handling identity loading, login, logout, and state tracking.",
  "frontend/src/hooks/useSubmitContactRequest.ts": "Empty or placeholder file with no implementation.",
  "frontend/src/index.css": "Configures Tailwind layers and defines extensive CSS variables for light/dark theming with OKLCH colors and base utility styles.",
  "frontend/src/lib/scrollToSection.ts": "Provides a smooth scrolling helper that offsets for the header height when navigating to page sections.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it in React Query and Internet Identity providers before rendering.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters, including sessionStorage support and hash-based routing handling.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, typography, animations, breakpoints, and plugins using CSS variables.",
  "project_state.json": "Stores project metadata, requirements, architectural notes, and known issues for the landing page build."
}