{
  "backend/main.mo": "Motoko canister with access-controlled user profiles and a public contact-request submission system stored in lists and maps.",
  "feature_evidence.json": "Feature evidence report mapping a header-height reduction change to affected frontend files and component versions.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend source files, describing structure, styling, and component behavior.",
  "frontend/.ic-assets.json": "Asset config ensuring the .well-known directory is included when deploying frontend canister assets.",
  "frontend/index.css": "Global Tailwind-based OKLCH theme variables and dark mode definitions applied to base elements.",
  "frontend/index.html": "HTML entry point loading fonts and mounting the React application root.",
  "frontend/public/.well-known/ic-domains": "IC custom-domain verification file listing the apex and www domain names.",
  "frontend/public/robots.txt": "Robots.txt allowing major crawlers full access for SEO.",
  "frontend/src/App.tsx": "Main React app composing all landing page sections with header, sections, and footer.",
  "frontend/src/components/AboutSection.tsx": "About section with descriptive text, trust indicators, and a featured image.",
  "frontend/src/components/ContactForm.tsx": "Formspree-backed contact form with required fields and styled input components.",
  "frontend/src/components/ContactSection.tsx": "Contact area combining the contact form with business details and social links.",
  "frontend/src/components/FeaturesSection.tsx": "Renders a features grid showcasing four service highlights with icons, text, and a CTA video link.",
  "frontend/src/components/Footer.tsx": "Displays footer with branding, navigation links, legal links, and attribution including dynamic year and referral URL.",
  "frontend/src/components/HeroSection.tsx": "Provides a fullscreen hero with background image, headline, description, and buttons that scroll to other sections.",
  "frontend/src/components/LandingHeader.tsx": "Implements a responsive header with scroll effects, navigation links, logo, and a mobile menu toggle.",
  "frontend/src/components/ScheduleConsultationSection.tsx": "Shows a consultation booking section that loads and displays a Calendly widget when triggered.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including login, logout, and state handling.",
  "frontend/src/hooks/useSubmitContactRequest.ts": "Empty or placeholder file with no implementation provided.",
  "frontend/src/index.css": "Configures Tailwind base layers and defines extensive light/dark theme CSS variables plus global layout rules.",
  "frontend/src/lib/scrollToSection.ts": "Provides a smooth-scrolling function that scrolls to a section ID with header offset handling.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers, loading global styles.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL parameters with sessionStorage fallback.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and responsive settings using CSS variables.",
  "project_state.json": "Stores project metadata, existing features, and new feature requests for the header height reduction project."
}