{
  "backend/main.mo": "Motoko backend with authorization, storing contact requests and user profiles, exposing submit/view contact and profile CRUD with admin/user checks.",
  "feature_evidence.json": "Feature evidence report describing the required update to HeroSection.tsx background image and listing related components and test IDs.",
  "frontend-file-summaries.txt": "Pre-generated summaries of multiple frontend files including layout, components, styling, and configuration details.",
  "frontend/.ic-assets.json": "Specifies that the .well-known directory should be included in deployed frontend assets.",
  "frontend/index.css": "Tailwind base styles with extensive OKLCH color variables for light and dark modes and global element defaults.",
  "frontend/index.html": "HTML entry file defining metadata, fonts, and the root element for the React app.",
  "frontend/public/.well-known/ic-domains": "IC custom domain verification file listing the root and www domains.",
  "frontend/public/robots.txt": "SEO robots.txt allowing all major crawlers full access.",
  "frontend/src/App.tsx": "Main app component composing the landing page sections and footer.",
  "frontend/src/components/AboutSection.tsx": "About section with descriptive text, trust indicators, and an accompanying image.",
  "frontend/src/components/ContactForm.tsx": "Simple Formspree-powered contact form with required fields and styled inputs.",
  "frontend/src/components/ContactSection.tsx": "Contact section combining the Formspree form with contact details and social links.",
  "frontend/src/components/FeaturesSection.tsx": "Renders a features section with four feature cards, titles, descriptions, and a YouTube CTA link.",
  "frontend/src/components/Footer.tsx": "Displays a footer with brand info, navigation links, legal links, and a caffeinated.ai attribution.",
  "frontend/src/components/HeroSection.tsx": "Provides a full-screen hero with background image, headline, description, and buttons that scroll to sections.",
  "frontend/src/components/LandingHeader.tsx": "Implements a responsive header with scroll-based styling, navigation links, logo, and mobile menu handling.",
  "frontend/src/components/ScheduleConsultationSection.tsx": "Shows a consultation booking section that loads and displays a Calendly embed when triggered.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and helpers for managing Internet Identity login, logout, and stored identities.",
  "frontend/src/hooks/useSubmitContactRequest.ts": "Empty or placeholder file with no implementation.",
  "frontend/src/index.css": "Defines Tailwind layers and global CSS variables for light and dark themes, plus base styles for body and html.",
  "frontend/src/lib/scrollToSection.ts": "Provides a smooth-scrolling helper that scrolls to a DOM section ID while accounting for header offset.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global CSS.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, color variables, fonts, animations, and plugins.",
  "project_state.json": "Tracks project state, including requirements to replace the hero background image and add the uploaded asset."
}