{
  "backend/main.mo": "Motoko canister handling public contact form submissions and admin‑restricted retrieval, using access control mixin.",
  "feature_evidence.json": "Feature evidence describing addition of a CTA button in FeaturesSection and listing related components.",
  "frontend-file-summaries.txt": "Prewritten summaries for multiple frontend files describing styling, components, and behavior.",
  "frontend/.ic-assets.json": "Assets config ensuring the .well-known directory is included in the deployed frontend canister.",
  "frontend/index.css": "Tailwind base styles with OKLCH color variables for light/dark themes and global element styling.",
  "frontend/index.html": "HTML entry with meta tags, fonts, and root div loading the React app.",
  "frontend/public/.well-known/ic-domains": "Domain verification file listing the apex and www domains.",
  "frontend/src/App.tsx": "Main app component assembling all landing page sections.",
  "frontend/src/components/AboutSection.tsx": "About section describing Querétaro, trust indicators, and an accompanying image.",
  "frontend/src/components/ContactForm.tsx": "Formspree-backed contact form with required fields and styled inputs/buttons.",
  "frontend/src/components/ContactSection.tsx": "Contact section combining the ContactForm with business contact details and social links.",
  "frontend/src/components/FeaturesSection.tsx": "Features section listing four service highlights and including a YouTube-linked CTA button.",
  "frontend/src/components/Footer.tsx": "Renders a themed footer with brand info, navigation links, legal links, and a Caffeine attribution link using scroll-based navigation.",
  "frontend/src/components/HeroSection.tsx": "Displays a full-screen hero section with background image, headline, description, and buttons that trigger scrolling to key sections.",
  "frontend/src/components/LandingHeader.tsx": "Implements a responsive header with scroll-based styling, navigation buttons, logo, and a mobile menu toggle.",
  "frontend/src/components/ScheduleConsultationSection.tsx": "Provides a booking section that loads and scrolls to an embedded Calendly widget when the user clicks the Book button.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an authentication context for managing Internet Identity login state, identity loading, and logout behavior.",
  "frontend/src/hooks/useSubmitContactRequest.ts": "Placeholder hook with no implemented logic.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark themes with Querétaro-inspired colors.",
  "frontend/src/lib/scrollToSection.ts": "Exports a helper that smooth-scrolls to a section by ID while accounting for header offset.",
  "frontend/src/main.tsx": "Initializes React, wrapping the app with Internet Identity and React Query providers and loading global styles.",
  "frontend/src/utils/urlParams.ts": "Utility helpers to read URL parameters (including hash-based), persist them in sessionStorage, and clear them when needed.",
  "frontend/tailwind.config.js": "Tailwind configuration defining custom colors, fonts, breakpoints, animations, and plugins for styling the frontend.",
  "project_state.json": "Project metadata describing the landing page requirements, architecture notes, and existing features for build planning."
}