{
  "backend/main.mo": "Motoko canister managing contact form submissions and user profiles with admin and user permission checks.",
  "feature_evidence.json": "Feature evidence listing three hero‑image related features and the files, components, and test IDs they affect.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and updates of various frontend files.",
  "frontend/.ic-assets.json": "Asset configuration allowing inclusion of the .well-known directory.",
  "frontend/index.css": "Tailwind base layer defining OKLCH theme variables for light and dark modes and applying them globally.",
  "frontend/index.html": "HTML entry point with SEO meta tags, Google Fonts, and root mounting element.",
  "frontend/public/.well-known/ic-domains": "Domain list specifying allowed hostnames for IC boundary validation.",
  "frontend/public/robots.txt": "Robots.txt allowing all major crawlers full access.",
  "frontend/src/App.tsx": "Main React component assembling all landing page sections in order.",
  "frontend/src/components/AboutSection.tsx": "About section displaying business description, trust indicators, and an image.",
  "frontend/src/components/ContactForm.tsx": "Static HTML contact form posting to Formspree with required fields.",
  "frontend/src/components/ContactSection.tsx": "Contact section combining the contact form with contact details and social links.",
  "frontend/src/components/FeaturesSection.tsx": "Renders a features section with four feature cards and a CTA video link.",
  "frontend/src/components/Footer.tsx": "Displays site footer with brand info, navigation links, legal links, and a bottom bar with attribution.",
  "frontend/src/components/HeroSection.tsx": "Creates a hero banner with background image, headline, subtext, and buttons that scroll to other sections.",
  "frontend/src/components/LandingHeader.tsx": "Implements a responsive header with scroll-based styling, navigation links, and a mobile menu toggle.",
  "frontend/src/components/ScheduleConsultationSection.tsx": "Provides a booking section that loads and displays a Calendly inline widget on demand.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, state, and stored identities.",
  "frontend/src/hooks/useSubmitContactRequest.ts": "Empty file with no implementation.",
  "frontend/src/index.css": "Sets Tailwind layers and defines extensive light/dark CSS variables used for theming, plus global base styles and a custom text-balance utility.",
  "frontend/src/lib/scrollToSection.ts": "Provides a smooth scrolling function that navigates to a section by ID with header offset handling.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and sessionStorage parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors using CSS variables, custom fonts, radii, shadows, animations, and responsive settings.",
  "project_state.json": "Project metadata describing current features, pending requests, versioning, and architectural notes for the Real Estate Landing project."
}