{
  "backend/main.mo": "Actor implementing contact request submission, admin-restricted retrieval, and user profile storage with AccessControl authorization checks.",
  "feature_evidence.json": "Feature evidence report linking a social-link URL update to the ContactSection component and associated packages.",
  "frontend-file-summaries.txt": "List of summarized frontend files describing styling, components, utilities, and updates across the React app.",
  "frontend/.ic-assets.json": "Asset configuration that ensures the .well-known directory is included in deployments.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables for light and dark modes and applying global background and text settings.",
  "frontend/index.html": "HTML entry point configuring metadata, fonts, and loading the React application root.",
  "frontend/public/.well-known/ic-domains": "Domain configuration file listing allowed custom domains for the app.",
  "frontend/public/robots.txt": "SEO robots configuration allowing all major crawlers full access.",
  "frontend/src/App.tsx": "Main React component composing the full landing page layout from header to footer.",
  "frontend/src/components/AboutSection.tsx": "About section with business description, trust indicators, and an image layout.",
  "frontend/src/components/ContactForm.tsx": "Standalone Formspree-powered contact form with required fields and styled inputs.",
  "frontend/src/components/ContactSection.tsx": "Contact section combining the contact form, contact details, and social links including the updated Instagram URL.",
  "frontend/src/components/FeaturesSection.tsx": "Features grid highlighting four service advantages with icons and a CTA linking to a YouTube video.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with brand info, navigation links, legal links, and a credits bar with dynamic year and referral link.",
  "frontend/src/components/HeroSection.tsx": "Displays the main hero section with background image, headline, description, and buttons that trigger smooth scrolling.",
  "frontend/src/components/LandingHeader.tsx": "Implements a responsive header with scroll-based styling, navigation buttons, and a mobile menu toggle.",
  "frontend/src/components/ScheduleConsultationSection.tsx": "Provides a booking section that loads and displays a Calendly embed after clicking the Book button.",
  "frontend/src/hooks/useActor.ts": "Manages creation and caching of a backend actor tied to Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context, exposing login, logout, state management, and identity persistence.",
  "frontend/src/hooks/useSubmitContactRequest.ts": "Empty placeholder file for a contact request submission hook.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for theme colors, typography, and layout behavior.",
  "frontend/src/lib/scrollToSection.ts": "Provides a helper to smoothly scroll to a section by ID with header offset handling.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers before rendering the main App component.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL params from query or hash and persist them in sessionStorage, plus utilities to clear stored or hash parameters.",
  "frontend/tailwind.config.js": "TailwindCSS config defining content paths, theming, colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Metadata describing the project state, existing features, and a pending request to update an Instagram link."
}