{
  "backend/main.mo": "Motoko backend canister handling contact requests and user profiles with admin and user authorization checks.",
  "feature_evidence.json": "Feature evidence report linking a specific hero text color change to affected files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of each frontend file.",
  "frontend/.ic-assets.json": "Assets configuration enabling publishing of the .well-known directory for domain verification.",
  "frontend/index.css": "Global Tailwind-based style tokens defining OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Base HTML entry point loading fonts and mounting the React app root.",
  "frontend/public/.well-known/ic-domains": "IC domain verification file listing the apex and www domains.",
  "frontend/public/robots.txt": "Robots.txt allowing all major crawlers full access for SEO.",
  "frontend/src/App.tsx": "Main app component composing all landing-page sections in order.",
  "frontend/src/components/AboutSection.tsx": "About section describing the business, Querétaro context, and trust metrics with an accompanying image.",
  "frontend/src/components/ContactForm.tsx": "Simple Formspree-backed contact form with required fields and styled inputs.",
  "frontend/src/components/ContactSection.tsx": "Contact page section combining the contact form with business contact details and social links.",
  "frontend/src/components/FeaturesSection.tsx": "No summary available.",
  "frontend/src/components/Footer.tsx": "No summary available.",
  "frontend/src/components/HeroSection.tsx": "No summary available.",
  "frontend/src/components/LandingHeader.tsx": "No summary available.",
  "frontend/src/components/ScheduleConsultationSection.tsx": "No summary available.",
  "frontend/src/hooks/useActor.ts": "No summary available.",
  "frontend/src/hooks/useInternetIdentity.ts": "No summary available.",
  "frontend/src/hooks/useSubmitContactRequest.ts": "No summary available.",
  "frontend/src/index.css": "Sets global Tailwind layers and defines extensive light/dark theme CSS variables with layout and utility rules.",
  "frontend/src/lib/scrollToSection.ts": "Provides a smooth-scrolling helper that scrolls to an element by ID with header offset handling.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and sessionStorage parameters, supporting hash-based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, custom colors derived from CSS variables, animations, fonts, and plugins.",
  "project_state.json": "Defines project metadata, existing features, and a pending request to change hero section text color to white."
}